LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
                <register>
                    <name>CSTIM3</name>
                    <displayName>CSTIM3</displayName>
                    <description>SRAM/NOR-Flash chip-select timing register 3</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>Data Latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock Divide Factor Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSCTRL4</name>
                    <displayName>CSCTRL4</displayName>
                    <description>SRAM/NOR-Flash chip-select control register 4</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x000030D0</resetValue>
                    <fields>
                        <field>
                            <name>WRBURSTEN</name>
                            <description>Write PSRAM Burst Enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRAMPSIZECFG</name>
                            <description>CRAM Page Size Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>WSASYNCEN</name>
                            <description>Wait Signal During Asynchronous Transfers Enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXTMODEEN</name>
                            <description>Extended Mode Enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITEN</name>
                            <description>Wait Enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WREN</name>
                            <description>Write Memory Enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTIMCFG</name>
                            <description>Wait Timing Configure</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WRAPBEN</name>
                            <description>Wrapped Burst Mode Enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WSPOLCFG</name>
                            <description>Wait Signal Polarity Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BURSTEN</name>
                            <description>Burst Mode Enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>NORFMACCEN</name>
                            <description>NORFlash Memory Access Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MDBWIDCFG</name>
                            <description>Memory Data Bus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>ADMUXEN</name>
                            <description>Address/Data Multiplexing Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>Enable the Corresponding Memory Bank</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CSTIM4</name>
                    <displayName>CSTIM4</displayName>
                    <description>SRAM/NOR-Flash chip-select timing register 4</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFFFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DATALATCFG</name>
                            <description>Data Latency Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>CLKDIVCFG</name>
                            <description>Clock Divide Factor Configure</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL2</name>
                    <displayName>CTRL2</displayName>
                    <description>PC Card/NAND Flash control register 2</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <fields>
                        <field>
                            <name>ECCPSCFG</name>
                            <description>ECC Page Size Configure</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>A2RDCFG</name>
                            <description>ALE To RE Delay Configure</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>C2RDCFG</name>
                            <description>CLE To RE Delay Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ECCEN</name>
                            <description>ECC Computation Logic Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBWIDCFG</name>
                            <description>Databus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>PC Card/NAND Flash Memory Bank Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITFEN</name>
                            <description>PC Card/NANDFlash Wait Feature Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STSINT2</name>
                    <displayName>STSINT2</displayName>
                    <description>FIFO status and interrupt register 2</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000040</resetValue>
                    <fields>
                        <field>
                            <name>FEFLG</name>
                            <description>FIFO Empty Flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>IFEDEN</name>
                            <description>Interrupt Falling Edge Detection Enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLDEN</name>
                            <description>Interrupt High-Level Detection Enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREDEN</name>
                            <description>Interrupt Rising Edge Detection Enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IFEFLG</name>
                            <description>Interrupt Falling Edge Generate Flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IHLFLG</name>
                            <description>Interrupt High-Level Generate Flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IREFLG</name>
                            <description>Interrupt Rising Edge Generate Flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CMSTIM2</name>
                    <displayName>CMSTIM2</displayName>
                    <description>Common memory space timing register 2</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Common Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Common Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Common Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Common Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AMSTIM2</name>
                    <displayName>AMSTIM2</displayName>
                    <description>Attribute memory space timing register
 2</description>
                    <addressOffset>0x6C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0xFCFCFCFC</resetValue>
                    <fields>
                        <field>
                            <name>HIZx</name>
                            <description>Attribute Memory x Databus Hiz Time Configure</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>HLDx</name>
                            <description>Attribute Memory x Hold Time Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>WAITx</name>
                            <description>Attribute Memory x Wait Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>SETx</name>
                            <description>Attribute Memory x Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ECCRS2</name>
                    <displayName>ECCRS2</displayName>
                    <description>ECC result register 2</description>
                    <addressOffset>0x74</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>ECCRS</name>
                            <description>ECC result</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL3</name>
                    <displayName>CTRL3</displayName>
                    <description>PC Card/NAND Flash control register 3</description>
                    <addressOffset>0x80</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000018</resetValue>
                    <fields>
                        <field>
                            <name>ECCPSCFG</name>
                            <description>ECC Page Size Configure</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>A2RDCFG</name>
                            <description>ALE To RE Delay Configure</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>C2RDCFG</name>
                            <description>CLE To RE Delay Configure</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ECCEN</name>
                            <description>ECC Computation Logic Enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DBWIDCFG</name>
                            <description>Databus Width Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>MTYPECFG</name>
                            <description>Memory Type Configure</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MBKEN</name>
                            <description>PC Card/NAND Flash Memory Bank Enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WAITFEN</name>
                            <description>PC Card/NANDFlash Wait Feature Enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
