LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
                <register>
                    <name>WRTTIM3</name>
                    <displayName>WRTTIM3</displayName>
                    <description>SRAM/NOR-Flash write timing registers 3</description>
                    <addressOffset>0x114</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WRTTIM4</name>
                    <displayName>WRTTIM4</displayName>
                    <description>SRAM/NOR-Flash write timing registers 4</description>
                    <addressOffset>0x11C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0FFFFFFF</resetValue>
                    <fields>
                        <field>
                            <name>ASYNCACCCFG</name>
                            <description>Asynchronous Access Mode Configure</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>BUSTURNCFG</name>
                            <description>Bus Turnaround Phase Duration Configure</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DATASETCFG</name>
                            <description>Data-Setup Time Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>ADDRHLDCFG</name>
                            <description>Address-Hold Time Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>ADDRSETCFG</name>
                            <description>Address Setup Time Configure</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>RNG</name>
            <description>Random number generator</description>
            <groupName>RNG</groupName>
            <baseAddress>0x50060800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FPU</name>
                <description>FPU interrupt</description>
                <value>81</value>
            </interrupt>
            <interrupt>
                <name>HASH_RNG</name>
                <description>Rng global interrupt</description>
                <value>80</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>Interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGEN</name>
                            <description>Random number generator enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSINT</name>
                            <description>Seed error interrupt status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKERINT</name>
                            <description>Clock error interrupt status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSCSTS</name>
                            <description>Seed error current status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLKERCSTS</name>
                            <description>Clock error current status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATARDY</name>
                            <description>Data ready</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Random data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
