LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
                <register>
                    <name>APB1CLKEN</name>
                    <displayName>APB1CLKEN</displayName>
                    <description>APB1 peripheral clock enable
          register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWUEN</name>
                            <description>Power interface clock
              enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN2EN</name>
                            <description>CAN 2 clock enable</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CAN1EN</name>
                            <description>CAN 1 clock enable</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C3EN</name>
                            <description>I2C3 clock enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C2EN</name>
                            <description>I2C2 clock enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>I2C1EN</name>
                            <description>I2C1 clock enable</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART5EN</name>
                            <description>UART5 clock enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>UART4EN</name>
                            <description>UART4 clock enable</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART3EN</name>
                            <description>USART3 clock enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART2EN</name>
                            <description>USART 2 clock enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI3EN</name>
                            <description>SPI3 clock enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI2EN</name>
                            <description>SPI2 clock enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WWDTEN</name>
                            <description>Window watchdog clock
              enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR14EN</name>
                            <description>TMR14 clock enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR13EN</name>
                            <description>TMR13 clock enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR12EN</name>
                            <description>TMR12 clock enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR5EN</name>
                            <description>TMR5 clock enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR4EN</name>
                            <description>TMR4 clock enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR3EN</name>
                            <description>TMR3 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR2EN</name>
                            <description>TMR2 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>APB2CLKEN</name>
                    <displayName>APB2CLKEN</displayName>
                    <description>APB2 peripheral clock enable
          register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SPI5EN</name>
                            <description>SPI5 clock enable</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR11EN</name>
                            <description>TMR11 clock enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR10EN</name>
                            <description>TMR10 clock enable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR9EN</name>
                            <description>TMR9 clock enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYSCFGEN</name>
                            <description>System configuration controller clock
              enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI4EN</name>
                            <description>SPI4 clock enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SPI1EN</name>
                            <description>SPI1 clock enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SDIOEN</name>
                            <description>SDIO clock enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC2EN</name>
                            <description>ADC2 clock enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ADC1EN</name>
                            <description>ADC1 clock enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART6EN</name>
                            <description>USART6 clock enable</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>USART1EN</name>
                            <description>USART1 clock enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR8EN</name>
                            <description>TMR8 clock enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TMR1EN</name>
                            <description>TMR1 clock enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPAHB1CLKEN</name>
                    <displayName>LPAHB1CLKEN</displayName>
                    <description>AHB1 peripheral clock enable in low power
          mode register</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0061900F</resetValue>
                    <fields>
                        <field>
                            <name>DMA2EN</name>
                            <description>DMA2 clock enable during Sleep
              mode</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMA1EN</name>
                            <description>DMA1 clock enable during Sleep
              mode</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SRAM1EN</name>
                            <description>SRAM 1interface clock enable during
              Sleep mode</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FMCEN</name>
                            <description>Flash interface clock enable during
              Sleep mode</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CRCEN</name>
                            <description>CRC clock enable during Sleep
              mode</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PHEN</name>
                            <description>IO port H clock enable during Sleep
              mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PEEN</name>
                            <description>IO port E clock enable during Sleep
              mode</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PDEN</name>
                            <description>IO port D clock enable during Sleep
              mode</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PCEN</name>
                            <description>IO port C clock enable during Sleep
              mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PBEN</name>
                            <description>IO port B clock enable during Sleep
              mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PAEN</name>
                            <description>IO port A clock enable during sleep
              mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPAHB2CLKEN</name>
                    <displayName>LPAHB2CLKEN</displayName>
                    <description>AHB2 peripheral clock enable in low power
          mode register</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000080</resetValue>
                    <fields>
                        <field>
                            <name>OTGFSEN</name>
                            <description>USB OTG FS clock enable during Sleep
              mode</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGEN</name>
                            <description>Random number generator clock enable
              during Sleep mode</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>QSPIEN</name>
                            <description>QSPI enable during Sleep
mode</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>LPAHB3CLKEN</name>
                    <displayName>LPAHB3CLKEN</displayName>
                    <description>AHB3 peripheral clock enable in low power
          mode register</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000001</resetValue>
                    <fields>
                        <field>
                            <name>SMCEN</name>
                            <description>Flexible static memory controller module
              clock enable during Sleep mode</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
