LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>COMP1</name>
            <description>Comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x40013818</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>control and status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Comparator 1 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INMCCFG</name>
                            <description>Comparator 1  Input Minus Connection Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WMODESEL</name>
                            <description>Comparator 1 Window Mode Select</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>Comparator 1 output
Selest</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POLCFG</name>
                            <description>Comparator 1 Polarity Configure</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTVAL</name>
                            <description>Comparator 1 output status</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>COMP CSTS Register Lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>COMP2</name>
            <description>Comparator</description>
            <groupName>COMP</groupName>
            <baseAddress>0x4001381C</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x4</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>CSTS</name>
                    <displayName>CSTS</displayName>
                    <description>control and status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>EN</name>
                            <description>Comparator enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>SPEEDM</name>
                            <description>Comparator Speed Mode Select</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INMCCFG</name>
                            <description>Comparator Input Minus Connection Configure</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INPCCFG</name>
                            <description>Comparator Input Plus Connection Configure</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>3</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>Comparator output
Selest</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>4</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POLCFG</name>
                            <description>Comparator Polarity Configure</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>OUTVAL</name>
                            <description>Comparator output status</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>LOCK</name>
                            <description>COMP CSTS Register Lock</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
