LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RTC</name>
            <description>Real-time clock</description>
            <groupName>RTC</groupName>
            <baseAddress>0x40002800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>RTC_WKUP</name>
                <description>RTC Wakeup interrupt through the EINT line 22</description>
                <value>3</value>
            </interrupt>
            <interrupt>
                <name>RTC_Alarm</name>
                <description>RTC Alarms (A and B) through EINT line 17 interrupt</description>
                <value>41</value>
            </interrupt>
            <registers>
                <register>
                    <name>TIME</name>
                    <displayName>TIME</displayName>
                    <description>time register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TIMEFCFG</name>
                            <description>AM/PM notation</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HRT</name>
                            <description>Hour tens in BCD format</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>HRU</name>
                            <description>Hour units in BCD format</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>MINT</name>
                            <description>Minute tens in BCD format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MINU</name>
                            <description>Minute units in BCD format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>SECT</name>
                            <description>Second tens in BCD format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SECU</name>
                            <description>Second units in BCD format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATE</name>
                    <displayName>DATE</displayName>
                    <description>date register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00002101</resetValue>
                    <fields>
                        <field>
                            <name>YRT</name>
                            <description>Year tens in BCD format</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>YRU</name>
                            <description>Year units in BCD format</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>WEEKSEL</name>
                            <description>Week day units</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>MONT</name>
                            <description>Month tens in BCD format</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MONU</name>
                            <description>Month units in BCD format</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>DAYT</name>
                            <description>Date tens in BCD format</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>DAYU</name>
                            <description>Date units in BCD format</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>CALOEN</name>
                            <description>Calibration output enable</description>
                            <bitOffset>23</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OUTSEL</name>
                            <description>Output selection</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>POLCFG</name>
                            <description>Output polarity</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CALOSEL</name>
                            <description>Calibration Output Value Select</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BAKP</name>
                            <description>Backup</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WTCCFG</name>
                            <description>Subtract 1 hour (winter time
              change)</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>STCCFG</name>
                            <description>Add 1 hour (summer time
              change)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSIEN</name>
                            <description>Time-stamp interrupt
              enable</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTIEN</name>
                            <description>Wakeup timer interrupt
              enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBIEN</name>
                            <description>Alarm B interrupt enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAIEN</name>
                            <description>Alarm A interrupt enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSEN</name>
                            <description>Time stamp enable</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUTEN</name>
                            <description>Wakeup timer enable</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRBEN</name>
                            <description>Alarm B enable</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ALRAEN</name>
                            <description>Alarm A enable</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCALEN</name>
                            <description>Coarse digital calibration
              enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TIMEFCFG</name>
                            <description>Hour format</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RCMCFG</name>
                            <description>Read Calendar Value Mode Configure</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RCLKDEN</name>
                            <description>Reference clock detection enable (50 or
              60 Hz)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TSETECFG</name>
                            <description>Time-stamp event active
              edge</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>WUCLKSEL</name>
                            <description>Wakeup clock selection</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>initialization and status
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000007</resetValue>
                    <fields>
                        <field>
                            <name>ALRAWFLG</name>
                            <description>Alarm A write flag</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>ALRBWFLG</name>
                            <description>Alarm B write flag</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>WUTWFLG</name>
                            <description>Wakeup timer write flag</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SOPFLG</name>
                            <description>Shift operation pending</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>INITSFLG</name>
                            <description>Initialization status flag</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>RSFLG</name>
                            <description>Registers synchronization
              flag</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RINITFLG</name>
                            <description>Register Initialization Occur Flag</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>INITEN</name>
                            <description>Initialization Mode Enable</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALRAFLG</name>
                            <description>Alarm A flag</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ALRBFLG</name>
                            <description>Alarm B flag</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>WUTFLG</name>
                            <description>Wakeup timer flag</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSFLG</name>
                            <description>Time-stamp flag</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TSOVRFLG</name>
                            <description>Time-stamp overflow flag</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TP1FLG</name>
                            <description>Tamper detection flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>RCALPFLG</name>
                            <description>Recalibration pending Flag</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PSC</name>
                    <displayName>PSC</displayName>
                    <description>prescaler register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x007F00FF</resetValue>
                    <fields>
                        <field>
                            <name>APSC</name>
                            <description>Asynchronous prescaler
              factor</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>SPSC</name>
                            <description>Synchronous prescaler
              factor</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>15</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>AUTORLD</name>
                    <displayName>AUTORLD</displayName>
                    <description>wakeup timer register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000FFFF</resetValue>
                    <fields>
                        <field>
                            <name>WUAUTORE</name>
                            <description>Wakeup auto-reload value
              bits</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DCAL</name>
                    <displayName>DCAL</displayName>
                    <description>calibration register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DCALCFG</name>
                            <description>Digital calibration sign</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DCAL</name>
                            <description>Digital calibration</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>5</bitWidth>
                        </field>
                    </fields>
                </register>
