LuckkMaker/apm32-ceedling-example/svd/APM32F411.svd
                <register>
                    <name>DOEPTRS3</name>
                    <displayName>DOEPTRS3</displayName>
                    <description>device OUT endpoint-3 transfer size
          register</description>
                    <addressOffset>0x370</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PID_SPCNT</name>
                            <description>Received data PID/SETUP packet
              count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_FS_PWRCLK</name>
            <description>USB on the go full speed</description>
            <groupName>USB_OTG_FS</groupName>
            <baseAddress>0x50000E00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>FS_PCGCCTL</name>
                    <displayName>FS_PCGCCTL</displayName>
                    <description>OTG_FS power and clock gating control
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PCLKSTOP</name>
                            <description>Stop PHY clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLK</name>
                            <description>Gate HCLK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PHYSUS</name>
                            <description>PHY Suspended</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
    </peripherals>
</device>
